20240207T092747--kdoc-77-検証する方法があると理解が進む__essay.org
:properties:
:ID: 20240207T092747
:end:
#+title:      KDOC 77: 検証する方法があると理解が進む
#+date:       [2024-02-07 Wed 09:27]
#+filetags:   :essay:
#+identifier: 20240207T092747

* この文書のステータス
:LOGBOOK:
CLOCK: [2024-02-07 Wed 22:12]--[2024-02-07 Wed 22:37] =>  0:25
:END:
- 作成
  - [X] 2024-02-07 貴島
- レビュー
  - [X] 2024-02-08 貴島
* 概要
プログラムに関して、粒度を細かく仮定を検証する方法を知っているとより理解を深められる。ネタも増える。

たとえば。

- ~curl~

  細かくリクエストヘッダーを変えてリクエストして、返ってくるレスポンスのヘッダーやボディをテキストで確認できると、挙動の違いを明確にできる。リダイレクトまわりは特にわかりやすい。

- ~locale~

  設定中のlocaleやそれぞれの値を確認できると、挙動の違いを理解できる。

- データベーススキーマ

  マイグレーションはフレームワークやライブラリで便利にできることが多い。直にSQLは書かなくてもよくなっている。一方内部で何が起こっているかを理解しづらくなっている。前後でデータベーススキーマがどう変化したかをテキストで確認できると、理解しやすい。

* 関連
- [[id:20231014T125935][KDOC 45: プログラミング言語の内部的な違いをアセンブリから調べる]]。アセンブリから調べる方法を知ると、自分で考えて検証できるようになった
- [[id:20240206T225726][KDOC 73: odでファイルの中身を確認する方法]]。バイナリでファイルを確認できると、実際の保存がどのようになされているかが想像できる
- [[id:20221210T014600][KDOC 10: より理解する]]。理解について考えた
