20240207T092747--kdoc-77-検証する方法があると理解が進む__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-03-31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 77: 検証する方法があると理解が進む</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 77: 検証する方法があると理解が進む</h1>

<div id="outline-container-org18c196e" class="outline-2">
<h2 id="org18c196e"><a href="#org18c196e">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org18c196e">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-07 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-08 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8dd7e4c" class="outline-2">
<h2 id="org8dd7e4c"><a href="#org8dd7e4c">概要</a></h2>
<div class="outline-text-2" id="text-org8dd7e4c">
<p>
プログラムに関して、粒度を細かく仮定を検証する方法を知っているとより理解を深められる。ネタも増える。
</p>

<p>
たとえば。
</p>

<ul class="org-ul">
<li><p>
<code>curl</code>
</p>

<p>
細かくリクエストヘッダーを変えてリクエストして、返ってくるレスポンスのヘッダーやボディをテキストで確認できると、挙動の違いを明確にできる。リダイレクトまわりは特にわかりやすい。
</p></li>

<li><p>
<code>locale</code>
</p>

<p>
設定中のlocaleやそれぞれの値を確認できると、挙動の違いを理解できる。
</p></li>

<li><p>
データベーススキーマ
</p>

<p>
マイグレーションはフレームワークやライブラリで便利にできることが多い。直にSQLは書かなくてもよくなっている。一方内部で何が起こっているかを理解しづらくなっている。前後でデータベーススキーマがどう変化したかをテキストで確認できると、理解しやすい。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org8436d40" class="outline-2">
<h2 id="org8436d40"><a href="#org8436d40">関連</a></h2>
<div class="outline-text-2" id="text-org8436d40">
<ul class="org-ul">
<li><a href="20231014T125935--kdoc-45-プログラミング言語の内部的な違いをアセンブリから調べる__code.html#ID-20231014T125935">KDOC 45: プログラミング言語の内部的な違いをアセンブリから調べる</a>。アセンブリから調べる方法を知ると、自分で考えて検証できるようになった</li>
<li><a href="20240206T225726--kdoc-73-ファイルの中身をn進数で見る__code.html#ID-20240206T225726">KDOC 73: ファイルの中身を確認する方法</a>。バイナリでファイルを確認できると、実際の保存がどのようになされているかが想像できる</li>
<li><a href="20221210T014600--kdoc-10-より理解する__essay.html#ID-20221210T014600">KDOC 10: より理解する</a>。理解について考えた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
